{
  "categories": [
    "Web",
    "Proxy"
  ],
  "env": [
    {
      "name": "PUID",
      "label": "PUID",
      "default": "1000",
      "description": "for UserID"
    },
    {
      "name": "PGID",
      "label": "PGID",
      "default": "1000",
      "description": "for GroupID"
    },
    {
      "name": "TZ",
      "label": "TZ",
      "default": "America/Chicago",
      "description": "Specify a timezone to use for example America/New_York"
    },
    {
      "name": "URL",
      "label": "URL",
      "default": "yourdomain.url",
      "description": "Top url you have control over (customdomain.com if you own it, or customsubdomain.ddnsprovider.com if dynamic dns)."
    },
    {
      "name": "VALIDATION",
      "label": "VALIDATION",
      "default": "http",
      "description": "Certbot validation method to use, options are http, dns or duckdns (dns method also requires DNSPLUGIN variable set) (duckdns method requires DUCKDNSTOKEN variable set, and the SUBDOMAINS variable must be either empty or set to wildcard)."
    },
    {
      "name": "SUBDOMAINS",
      "label": "SUBDOMAINS",
      "default": "www,",
      "description": "Subdomains you'd like the cert to cover (comma separated, no spaces) ie. www,ftp,cloud. For a wildcard cert, set this exactly to wildcard (wildcard cert is available via dns and duckdns validation only)"
    },
    {
      "name": "EMAIL",
      "label": "EMAIL",
      "default": "",
      "description": "Optional e-mail address used for cert expiration notifications (Required for ZeroSSL)."
    }
  ],
  "description": "This container sets up an Nginx webserver and reverse proxy with php support and a built-in letsencrypt client that automates free SSL server certificate generation and renewal processes. It also contains fail2ban for intrusion prevention.",
  "image": "lscr.io/linuxserver/swag:latest",
  "logo": "https://raw.githubusercontent.com/JourneyOver/selfhosted_templates/main/images/swag-logo.png",
  "name": "swag",
  "hostname": "swag",
  "cap_add": "NET_ADMIN",
  "net": "bunni_network",
  "note": "Before running this container, make sure that the url and subdomains are properly forwarded to this container's host.<ul><li>- Port 443 on the internet side of the router should be forwarded to this container's port 443.</li><li>- If you need a dynamic dns provider, you can use the free provider duckdns.org where the url will be yoursubdomain.duckdns.org and the subdomains can be www,ftp,cloud</li><li>- The container detects changes to url and subdomains, revokes existing certs and generates new ones during start.</li><li>- It also detects changes to the DHLEVEL parameter and replaces the dhparams file.</li><li>- If you'd like to password protect your sites, you can use htpasswd. Run the following command on your host to generate the htpasswd file <code>docker exec -it letsencrypt htpasswd -c /config/nginx/.htpasswd \u0026lt;username\u0026gt;</code>",
  "officialDoc": "https://docs.linuxserver.io/images/docker-swag",
  "platform": "linux",
  "ports": [
    "80:80/tcp",
    "443:443/tcp"
  ],
  "restart_policy": "unless-stopped",
  "title": "SWAG",
  "type": 1,
  "volumes": [
    {
      "bind": "/portainer/Files/AppData/Config/Swag",
      "container": "/config"
    }
  ],
  "webpage": "https://github.com/linuxserver/docker-swag"
}
